# HandRail Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
HandRail Class
Members See Also
---
Represents a hand rail element in Autodesk Revit.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class HandRail : ContinuousRail
```

Visual Basic
---
```text
Public Class HandRail _
	Inherits ContinuousRail
```

Visual C++
---
```text
public ref class HandRail : public ContinuousRail
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Architecture..::..ContinuousRail Autodesk.Revit.DB.Architecture..::..HandRail
# See Also
HandRail Members
Autodesk.Revit.DB.Architecture Namespace